telegram-agents.org
#+TITLE: Telegram Agents Loom
#+DESCRIPTION: Multi-agent Telegram bot integration — enable/disable agents per machine
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both

* Schema

This file manages Telegram-connected AI agents across machines. Each agent
can be enabled/disabled per machine to avoid conflicts. Only one machine
should run a given agent at a time.

** Agent Definition Format
Each agent has:
- NAME: identifier
- TYPE: opencode|claude|hermes|codex|pi-agent|sapphire
- CONFIG_DIR: where config lives (tangled to ~/.config/{agent}/)
- ENV_FILE: runtime credentials (NOT in repo, gitignored)
- START_CMD: how to start the agent server
- BOT_PACKAGE: npm package for telegram bot (if applicable)
- PORT: default API port

** Machine Configuration
Machines are defined by hostname. Each machine has:
- ENABLED_AGENTS: list of agent names to run on that machine
- SSH_HOST: remote SSH connection string (if not local)

* Agent Registry

** OpenCode Telegram Bot
- Config: ~/.config/opencode-telegram-bot/
- Env vars: TELEGRAM_BOT_TOKEN, TELEGRAM_ALLOWED_USER_ID, OPENCODE_API_URL
- Start: opencode serve & ~/.npm-global/bin/opencode-telegram start
- Port: 4096

** Claude Code
- Config: ~/.claude/
- Start: claude --desktop serve &  (desktop mode for API)
- Port: 8080 (when serving)

** Hermes
- Config: ~/.hermes/
- Start: hermes serve
- Port: 8081

** OpenAI Codex
- Config: ~/.codex/ (or config location)
- Start: codex
- Port: 4097

** Pi Agent
- Config: ~/.config/pi-agent/
- Start: pi-agent serve
- Port: 4098

** Sapphire (future)
- Config: TBD
- Start: TBD
- Port: TBD

* Hosts Configuration

Define which agents run on which machines:

#+BEGIN_SRC conf :tangle all/.telegram-agents/hosts.conf
# ~/DotCortex/all/.telegram-agents/hosts.conf
# FORMAT: hostname|enabled_agents|ssh_host

thinkpad-t480s|opencode|t480s
thinkpad-x230|opencode,hermes|x230
#+END_SRC

* Agent Config Templates

** OpenCode Telegram Bot Env Template

#+BEGIN_SRC conf :tangle all/.telegram-agents/templates/opencode-telegram.env
# OpenCode Telegram Bot Configuration
# Copy to ~/.config/opencode-telegram-bot/.env on target machine

TELEGRAM_BOT_TOKEN=YOUR_BOT_TOKEN
TELEGRAM_ALLOWED_USER_ID=YOUR_USER_ID
OPENCODE_API_URL=http://localhost:4096
OPENCODE_MODEL_PROVIDER=opencode
OPENCODE_MODEL_ID=big-pickle
BOT_LOCALE=en
TASK_LIMIT=10
#+END_SRC

* Agent Control Script

#+BEGIN_SRC bash :tangle all/.local/bin/telegram-agent-host :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/telegram-agent-host
# Manage which Telegram agents run on this machine

set -euo pipefail

AGENTS_DIR="${DOTCORTEX_AGENTS_DIR:-$HOME/DotCortex/all/.telegram-agents}"
CONFIG_DIR="$HOME/.config"
HOSTS_FILE="$AGENTS_DIR/hosts.conf"
STATE_DIR="${XDG_STATE_HOME:-$HOME/.local/state}/telegram-agents"

usage() {
    cat <<EOF
Usage: telegram-agent-host <command> [agent]

Commands:
  list              List all known agents
  status            Show which agents are running
  enable <agent>    Enable agent on this machine
  disable <agent>   Disable agent on this machine
  sync              Sync configs to this machine from DotCortex
  start             Start all enabled agents
  stop              Stop all agents
  switch <machine> Switch to another machine's agents (disables local, enables remote)
  bring           Bring agents to this machine (stop remote, start local)

Agents: opencode claudecode hermes codex pi-agent sapphire

Examples:
  telegram-agent-host list
  telegram-agent-host status
  telegram-agent-host enable opencode
  telegram-agent-host disable opencode
  telegram-agent-host switch x230
EOF
}

mkdir -p "$STATE_DIR"

get_hostname() {
    hostname | tr '[:upper:]' '[:lower:]'
}

get_enabled_agents() {
    local host="$1"
    grep -i "^${host}|" "$HOSTS_FILE" 2>/dev/null | cut -d'|' -f2 | tr ',' ' '
}

is_agent_enabled() {
    local agent="$1"
    local host
    host=$(get_hostname)
    local enabled
    enabled=$(get_enabled_agents "$host")
    echo "$enabled" | grep -qw "$agent"
}

list_agents() {
    echo "Known agents:"
    echo "  opencode    - OpenCode + Telegram bot"
    echo "  claudecode  - Claude Code desktop"
    echo "  hermes      - Hermes agent"
    echo "  codex       - OpenAI Codex"
    echo "  pi-agent    - Pi Coding Agent"
    echo "  sapphire    - Sapphire (not yet installed)"
    echo ""
    echo "Configured hosts:"
    if [ -f "$HOSTS_FILE" ]; then
        grep -v '^#' "$HOSTS_FILE" | grep -v '^$'
    else
		echo " (no hosts.conf found)"
	fi
}

check_opencode() {
    if pgrep -f "opencode serve" >/dev/null 2>&1; then
        echo "  opencode serve: RUNNING"
    else
        echo "  opencode serve: STOPPED"
    fi
    if pgrep -f "opencode-telegram" >/dev/null 2>&1; then
        echo "  opencode-telegram: RUNNING"
    else
        echo "  opencode-telegram: STOPPED"
    fi
}

check_claudecode() {
    if pgrep -f "claude.*serve" >/dev/null 2>&1; then
        echo "  claude --desktop serve: RUNNING"
    else
        echo "  claude --desktop serve: STOPPED"
    fi
}

check_hermes() {
    if pgrep -f "hermes serve" >/dev/null 2>&1; then
        echo "  hermes serve: RUNNING"
    else
        echo "  hermes serve: STOPPED"
    fi
}

check_codex() {
    if pgrep -f "codex" >/dev/null 2>&1; then
        echo "  codex: RUNNING"
    else
        echo "  codex: STOPPED"
    fi
}

check_pi_agent() {
    if pgrep -f "pi-agent" >/dev/null 2>&1; then
        echo "  pi-agent: RUNNING"
    else
        echo "  pi-agent: STOPPED"
    fi
}

status_cmd() {
    local host
    host=$(get_hostname)
    echo "Host: $host"
    echo "Enabled agents: $(get_enabled_agents "$host")"
    echo ""
    echo "Running processes:"
    check_opencode
    check_claudecode
    check_hermes
    check_codex
    check_pi_agent
}

enable_agent() {
    local agent="$1"
    local host
    host=$(get_hostname)

    if [ ! -f "$HOSTS_FILE" ]; then
        echo "Error: hosts.conf not found at $HOSTS_FILE"
        exit 1
    fi

    local line
    line=$(grep -i "^${host}|" "$HOSTS_FILE" 2>/dev/null || true)
    if [ -z "$line" ]; then
        echo "Error: host '$host' not found in hosts.conf"
        exit 1
    fi

    local current_agents
    current_agents=$(echo "$line" | cut -d'|' -f2)

    if echo "$current_agents" | grep -qw "$agent"; then
        echo "$agent is already enabled on $host"
        return
    fi

    local new_agents
    if [ -z "$current_agents" ]; then
        new_agents="$agent"
    else
        new_agents="$current_agents,$agent"
    fi

    sed -i "s|^${host}|.*|${host}|${new_agents}|I" "$HOSTS_FILE"
    echo "Enabled $agent on $host"
    echo "Run 'telegram-agent-host sync' to apply, then 'telegram-agent-host start'"
}

disable_agent() {
    local agent="$1"
    local host
    host=$(get_hostname)

    if [ ! -f "$HOSTS_FILE" ]; then
        echo "Error: hosts.conf not found at $HOSTS_FILE"
        exit 1
    fi

    local line
    line=$(grep -i "^${host}|" "$HOSTS_FILE" 2>/dev/null || true)
    if [ -z "$line" ]; then
        echo "Error: host '$host' not found in hosts.conf"
        exit 1
    fi

    local current_agents
    current_agents=$(echo "$line" | cut -d'|' -f2)

    if ! echo "$current_agents" | grep -qw "$agent"; then
        echo "$agent is not enabled on $host"
        return
    fi

    local new_agents
    new_agents=$(echo "$current_agents" | tr ',' '\n' | grep -v "^${agent}$" | tr '\n' ',' | sed 's/,$//' | sed 's/^,//')

    sed -i "s|^${host}|.*|${host}|${new_agents}|I" "$HOSTS_FILE"
    echo "Disabled $agent on $host"
    echo "Run 'telegram-agent-host stop $agent' to stop it"
}

sync_configs() {
    echo "Syncing agent configs from DotCortex..."
    local repo="$HOME/DotCortex"

    if [ ! -d "$repo/all/.telegram-agents" ]; then
        echo "Error: DotCortex/.telegram-agents not found"
        exit 1
    fi

    mkdir -p "$HOME/.config/opencode-telegram-bot"
    mkdir -p "$HOME/.config/pi-agent" 2>/dev/null || true
    mkdir -p "$HOME/.config/telegram-agents"

    if [ -f "$repo/all/.telegram-agents/hosts.conf" ]; then
        cp "$repo/all/.telegram-agents/hosts.conf" "$HOME/.config/telegram-agents/hosts.conf"
    fi

    echo "Config sync complete. Update credentials manually if needed."
}

start_agent() {
    local agent="$1"
    case "$agent" in
	opencode)
		if ! pgrep -f "opencode serve" >/dev/null 2>&1; then
			echo "Starting opencode serve..."
			nohup opencode serve > "$STATE_DIR/opencode-serve.log" 2>&1 </dev/null &
			sleep 2
		fi
		if ! pgrep -f "opencode-telegram" >/dev/null 2>&1; then
			echo "Starting opencode-telegram..."
			nohup ~/.npm-global/bin/opencode-telegram start > "$STATE_DIR/opencode-telegram.log" 2>&1 </dev/null &
			sleep 3
		fi
		;;
        claudecode)
            echo "Starting claude --desktop serve..."
            nohup claude --desktop serve > "$STATE_DIR/claude.log" 2>&1 &
            ;;
        hermes)
            if command -v hermes >/dev/null 2>&1; then
                echo "Starting hermes serve..."
                nohup hermes serve > "$STATE_DIR/hermes.log" 2>&1 &
            else
                echo "hermes not found in PATH"
            fi
            ;;
        codex)
            echo "Starting codex..."
            nohup codex > "$STATE_DIR/codex.log" 2>&1 &
            ;;
        pi-agent)
            if command -v pi-agent >/dev/null 2>&1; then
                echo "Starting pi-agent..."
                nohup pi-agent serve > "$STATE_DIR/pi-agent.log" 2>&1 &
            else
                echo "pi-agent not found. Is @mariozechner/pi-coding-agent installed?"
            fi
            ;;
        sapphire)
            echo "Sapphire not yet installed"
            ;;
        *)
            echo "Unknown agent: $agent"
            exit 1
            ;;
    esac
    echo "$agent started"
}

stop_agent() {
    local agent="$1"
    case "$agent" in
        opencode)
            pkill -f "opencode-telegram" 2>/dev/null || true
            pkill -f "opencode serve" 2>/dev/null || true
            ;;
        claudecode)
            pkill -f "claude --desktop serve" 2>/dev/null || true
            ;;
        hermes)
            pkill -f "hermes serve" 2>/dev/null || true
            ;;
        codex)
            pkill -f "codex" 2>/dev/null || true
            ;;
        pi-agent)
            pkill -f "pi-agent" 2>/dev/null || true
            ;;
        sapphire)
            pkill -f "sapphire" 2>/dev/null || true
            ;;
        *)
            echo "Unknown agent: $agent"
            exit 1
            ;;
    esac
    echo "$agent stopped"
}

start_all() {
    local host
    host=$(get_hostname)
    local agents
    agents=$(get_enabled_agents "$host")

    if [ -z "$agents" ]; then
        echo "No agents enabled for $host. Run 'telegram-agent-host enable <agent>' first."
        exit 1
    fi

    echo "Starting enabled agents for $host: $agents"
    for agent in $agents; do
        start_agent "$agent"
    done
}

stop_all() {
    for agent in opencode claudecode hermes codex pi-agent sapphire; do
        stop_agent "$agent" 2>/dev/null || true
    done
    echo "All agents stopped"
}

switch_to_machine() {
    local target="$1"
    local current_host
    current_host=$(get_hostname)

    if [ "$current_host" = "$target" ]; then
        echo "Already on $target"
        return
    fi

    local target_agents
    target_agents=$(get_enabled_agents "$target")

    if [ -z "$target_agents" ]; then
        echo "No agents configured for $target"
        exit 1
    fi

    local target_ssh
    target_ssh=$(grep -i "^${target}|" "$HOSTS_FILE" 2>/dev/null | cut -d'|' -f3)

    echo "Switching from $current_host to $target"

    echo "Stopping all agents on $current_host..."
    stop_all

    echo "Stopping agents on $target before restart..."
    if [ -n "$target_ssh" ]; then
        ssh "$target_ssh" "pkill -f 'opencode-telegram' 2>/dev/null || true; pkill -f 'opencode serve' 2>/dev/null || true; pkill -f 'hermes serve' 2>/dev/null || true; pkill -f 'pi-agent' 2>/dev/null || true" 2>/dev/null || true
        sleep 1
    fi

    echo "Starting agents on $target via SSH..."
    if [ -n "$target_ssh" ]; then
        ssh "$target_ssh" "\$HOME/.local/bin/telegram-agent-remote-start $target_agents"
        echo "Switched to $target"
    else
        echo "No SSH config for $target. Manually start on target machine:"
        echo " ssh $target"
        echo " telegram-agent-host start"
    fi
    echo ""
    echo "Enabled on $target: $target_agents"
}

bring_here() {
    local current_host
    current_host=$(get_hostname)
    local agents
    agents=$(get_enabled_agents "$current_host")

    if [ -z "$agents" ]; then
        echo "No agents configured for $current_host"
        exit 1
    fi

    echo "Bringing agents to $current_host..."

    for host_line in $(grep -v '^#' "$HOSTS_FILE" | grep -v '^$'); do
        local other_host
        other_host=$(echo "$host_line" | cut -d'|' -f1)
        if [ "$other_host" != "$current_host" ]; then
            local other_ssh
            other_ssh=$(echo "$host_line" | cut -d'|' -f3)
            if [ -n "$other_ssh" ]; then
                echo "Stopping agents on $other_host..."
                ssh "$other_ssh" "pkill -f 'opencode-telegram' 2>/dev/null || true; pkill -f 'opencode serve' 2>/dev/null || true; pkill -f 'hermes serve' 2>/dev/null || true" 2>/dev/null || true
            fi
        fi
    done

    sleep 1
    echo "Starting agents locally..."
    start_all
}

COMMAND="${1:-}"
shift || true

case "$COMMAND" in
    list) list_agents ;;
    status) status_cmd ;;
    enable) enable_agent "${1:-}" ;;
    disable) disable_agent "${1:-}" ;;
    sync) sync_configs ;;
    start)
        if [ -n "${1:-}" ]; then
            start_agent "$1"
        else
            start_all
        fi
        ;;
    stop)
        if [ -n "${1:-}" ]; then
            stop_agent "$1"
        else
            stop_all
        fi
        ;;
    switch) switch_to_machine "${1:-}" ;;
bring) bring_here ;;
    *) usage; exit 1 ;;
esac
#+END_SRC

* Remote Start Helper

This script runs on the target machine via SSH. It kills existing processes,
starts new ones, waits for confirmation, then exits cleanly.

#+BEGIN_SRC bash :tangle all/.local/bin/telegram-agent-remote-start :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/telegram-agent-remote-start
# Run on target machine via SSH to start agents.
# Usage: telegram-agent-remote-start <agent> [agent ...]

set -euo pipefail

STATE_DIR="${XDG_STATE_HOME:-$HOME/.local/state}/telegram-agents"
mkdir -p "$STATE_DIR"

for agent in "$@"; do
    case "$agent" in
    opencode)
        echo "Stopping existing opencode processes..."
        pkill -f "opencode-telegram" 2>/dev/null || true
        pkill -f "opencode serve" 2>/dev/null || true
        sleep 1
        echo "Starting opencode serve..."
        nohup opencode serve > "$STATE_DIR/opencode-serve.log" 2>&1 </dev/null &
        disown
        sleep 3
        echo "Starting opencode-telegram..."
        nohup ~/.npm-global/bin/opencode-telegram start > "$STATE_DIR/opencode-telegram.log" 2>&1 </dev/null &
        disown
        sleep 3
        if pgrep -f "opencode-telegram" >/dev/null 2>&1; then
            echo "opencode-telegram: STARTED OK"
        else
            echo "opencode-telegram: FAILED TO START"
        fi
        ;;
    *)
        echo "Agent $agent not yet supported for remote start"
        ;;
    esac
done
#+END_SRC

* Sync Script for X230

#+BEGIN_SRC bash :tangle all/.local/bin/telegram-agent-sync-x230 :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/telegram-agent-sync-x230
# Sync telegram-agent config to X230

set -euo pipefail

DOTCORTEX="$HOME/DotCortex"
X230_HOST="x230"
STATE_DIR="${XDG_STATE_HOME:-$HOME/.local/state}/telegram-agents"

echo "== Syncing Telegram Agent configs to X230 =="

# Sync hosts.conf
echo "Syncing hosts.conf..."
rsync -az --rsync-path="mkdir -p ~/.config && rsync" "$DOTCORTEX/all/.telegram-agents/hosts.conf" "$X230_HOST:~/.config/telegram-agents/hosts.conf" 2>/dev/null || \
    scp "$DOTCORTEX/all/.telegram-agents/hosts.conf" "$X230_HOST:~/.config/telegram-agents/hosts.conf"

# Sync opencode-telegram-bot config if it exists locally
if [ -f "$HOME/.config/opencode-telegram-bot/.env" ]; then
    echo "Syncing opencode-telegram-bot .env..."
    ssh "$X230_HOST" "mkdir -p ~/.config/opencode-telegram-bot"
    rsync -az --rsync-path="mkdir -p ~/.config && rsync" "$HOME/.config/opencode-telegram-bot/.env" "$X230_HOST:~/.config/opencode-telegram-bot/.env" 2>/dev/null || \
        scp "$HOME/.config/opencode-telegram-bot/.env" "$X230_HOST:~/.config/opencode-telegram-bot/.env"
fi

echo "Sync complete."
echo "On X230, run:"
echo "  cd ~/DotCortex && make tangle"
echo "  telegram-agent-host sync"
echo "  telegram-agent-host status"
#+END_SRC

* Makefile Fragment

#+BEGIN_SRC makefile :tangle all/.mk/telegram-agents.mk :padline no
# ~/DotCortex/all/.mk/telegram-agents.mk
.RECIPEPREFIX := |
.PHONY: telegram-agents-list telegram-agents-status telegram-agents-enable
.PHONY: telegram-agents-disable telegram-agents-start telegram-agents-stop
.PHONY: telegram-agents-sync telegram-agents-switch

telegram-agents-list:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host list

telegram-agents-status:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host status

telegram-agents-enable:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host enable $(AGENT)

telegram-agents-disable:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host disable $(AGENT)

telegram-agents-start:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host start

telegram-agents-stop:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host stop

telegram-agents-sync:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host sync

telegram-agents-switch:
| @chmod +x $(HOME)/.local/bin/telegram-agent-host 2>/dev/null || true
| $(HOME)/.local/bin/telegram-agent-host switch $(MACHINE)
#+END_SRC