all/.local/bin/telegram-agent-remote-start
#!/usr/bin/env bash
# Remote Start Helper

# This script runs on the target machine via SSH. It kills existing processes,
# starts new ones, waits for confirmation, then exits cleanly.


# [[file:../../../telegram-agents.org::*Remote Start Helper][Remote Start Helper:1]]
# ~/DotCortex/all/.local/bin/telegram-agent-remote-start
# Run on target machine via SSH to start agents.
# Usage: telegram-agent-remote-start <agent> [agent ...]

set -euo pipefail

STATE_DIR="${XDG_STATE_HOME:-$HOME/.local/state}/telegram-agents"
mkdir -p "$STATE_DIR"

for agent in "$@"; do
    case "$agent" in
    opencode)
        echo "Stopping existing opencode processes..."
        pkill -f "opencode-telegram" 2>/dev/null || true
        pkill -f "opencode serve" 2>/dev/null || true
        sleep 1
        echo "Starting opencode serve..."
        nohup opencode serve > "$STATE_DIR/opencode-serve.log" 2>&1 </dev/null &
        disown
        sleep 3
        echo "Starting opencode-telegram..."
        nohup ~/.npm-global/bin/opencode-telegram start > "$STATE_DIR/opencode-telegram.log" 2>&1 </dev/null &
        disown
        sleep 3
        if pgrep -f "opencode-telegram" >/dev/null 2>&1; then
            echo "opencode-telegram: STARTED OK"
        else
            echo "opencode-telegram: FAILED TO START"
        fi
        ;;
    *)
        echo "Agent $agent not yet supported for remote start"
        ;;
    esac
done
# Remote Start Helper:1 ends here
