all/.local/bin/telegram-agent-sync-x230
#!/usr/bin/env bash
# Sync Script for X230


# [[file:../../../telegram-agents.org::*Sync Script for X230][Sync Script for X230:1]]
# ~/DotCortex/all/.local/bin/telegram-agent-sync-x230
# Sync telegram-agent config to X230

set -euo pipefail

DOTCORTEX="$HOME/DotCortex"
X230_HOST="x230"
STATE_DIR="${XDG_STATE_HOME:-$HOME/.local/state}/telegram-agents"

echo "== Syncing Telegram Agent configs to X230 =="

# Sync hosts.conf
echo "Syncing hosts.conf..."
rsync -az --rsync-path="mkdir -p ~/.config && rsync" "$DOTCORTEX/all/.telegram-agents/hosts.conf" "$X230_HOST:~/.config/telegram-agents/hosts.conf" 2>/dev/null || \
    scp "$DOTCORTEX/all/.telegram-agents/hosts.conf" "$X230_HOST:~/.config/telegram-agents/hosts.conf"

# Sync opencode-telegram-bot config if it exists locally
if [ -f "$HOME/.config/opencode-telegram-bot/.env" ]; then
    echo "Syncing opencode-telegram-bot .env..."
    ssh "$X230_HOST" "mkdir -p ~/.config/opencode-telegram-bot"
    rsync -az --rsync-path="mkdir -p ~/.config && rsync" "$HOME/.config/opencode-telegram-bot/.env" "$X230_HOST:~/.config/opencode-telegram-bot/.env" 2>/dev/null || \
        scp "$HOME/.config/opencode-telegram-bot/.env" "$X230_HOST:~/.config/opencode-telegram-bot/.env"
fi

echo "Sync complete."
echo "On X230, run:"
echo "  cd ~/DotCortex && make tangle"
echo "  telegram-agent-host sync"
echo "  telegram-agent-host status"
# Sync Script for X230:1 ends here
